MathematicalLogicAndTheoreticalCS/AMathIntroToLogic/AMathIntroToLogic.org
#+title: A Mathematical Introduction To Logic
#+AUTHOR: Herbert Enderton
#+author: Notes taken by Dendy Li
#+LATEX_HEADER: \input{~/Preamble/preamble.tex}
#+LATEX_COMPILER: xelatex

* Sentential Logic
** Informal remarks on the basic objects

\begin{center}\begin{tikzcd}
& \text{Construction Sequence} & \\
& \text{Wffs} \ar[u,"\text{Formula Building Operations}"] & \\
& \text{Expressions} \ar[u,"\text{Inductive Definition}"] & \\
& \text{Sequence} \ar[u] & \\
\text{Sentential Connectives Symbols} \ar[ur] & \text{Sentence Symbols} \ar[u] & \text{Proposition Symbols} \ar[l]
\end{tikzcd}\end{center}


#+ATTR_LATEX: :options [Sentential Connective Symbols]
#+BEGIN_definition
Sentential connective symbols is the symbols which have fixed translations.
#+END_definition

eg. We have five sentential connective symbols in sentential logic namely
+ \(\neg\)
+ Conjunction \(\land\)
+ Disjunction \(\lor\)
+ Implies \(\rightarrow\)
+ Iff \(\leftrightarrow\)

#+ATTR_LATEX: :options [Sentence Symbols]
#+BEGIN_definition
Sentence symbols are the symbols which doesn't fixed the translation.
#+END_definition

*Remark: We also have proposition symbols for some case we want the translation of them are propositions*

#+ATTR_LATEX: :options [Expressions]
#+BEGIN_definition
Expressions just finite sequence of symbols(both sentential connective symbols and sentence symbols).
#+END_definition

*Remark: In order to avoid the Russuell's Paradox we assume that no symbol is a finite sequence of symbols*

#+ATTR_LATEX: :options [Well Form Formula]
#+BEGIN_definition
Well form formulas are just Grammarly correct expressions. By Grammarly correct we means the inductive definition of the well form formula.
#+END_definition

#+ATTR_LATEX: :options [Inductive definition of wffs]
#+BEGIN_proposition
All the wffs can only be obtained by the following rules
+ Every sentence symbol is a wff
+ If \(\alpha\) is a formula then \(\neg\alpha\) is a wff
+ If \(\alpha, \beta\) are wffs then \(\alpha \circ \beta\) is a wff
Here \(\circ\) represents the other 4 sentential connectives we didn't mention above.
#+END_proposition

We will then define the formula building operations to show how wff is built up.

#+ATTR_LATEX: :options [Formula building operations]
#+BEGIN_definition
For wff \(\alpha,\beta\), formula building operation is defined as follows:
+ \(\Epsilon_{\neg} (\alpha) = (\neg\alpha)\)
+ \(\Epsilon_{\circ} (\alpha,\beta) = (\alpha \circ \beta)\)
Here \(\circ\) is one of the other 4 sentential connectives.
#+END_definition

#+ATTR_LATEX: :options [Construction Sequence of a wff]
#+BEGIN_definition
The construction sequence of a wff \(\alpha\) is a sequence \(<a_1,\dots,\alpha>\), where every \(a_i\) is obtained by element in the front of \(a_i\) under the formula building operations.
#+END_definition

** Induction
*Induction is a special type of construction, especially when we face the problem that the inductive defintion brings to us.*

Here we have "Universal" progress on meta-strategy of how induction works:
*Goal: Starting from a set \(U\), construct a subset of \(U\) satisfies certain properties.*

\begin{center}\begin{tikzcd}
\text{Initial elements} \ar[loop right, "\text{Construction operations}"] \ar[d] \\
\text{Smallest set closed under the operations}
\end{tikzcd}\end{center}

*Remark: Every members in the "Gerating Set" can be build up from the initial elements by apply the construction operations. This also arise the interests to talk about the definition of free generation, namely whether the construction sequence is unique or not.*

eg. We can have an easy understandable case where the initial elements are just the sentence symbols, the operations are formula building operations. In this case the set we generate is just the set of well-formed-formulas.

Next we want to formally discuss this "Smallest Set". For convinient we use the following conventions:
- Initial set \(B \subseteq U\)
- Class of operations \(\mathcal{F}:=\{f,g\}\), where \(f:U \times U \to U, g: U \to U\).
  Notice that in a general case the class of operations should be infinite.

With the notation above we use a little more formal language to represent the process:

WLOG suppose \(B\) contains points \(a,b\), then \(C\) will contain the elements in the form of:
  \[
  b, f(b,b), g(b), f(g(a)), \dots
  \]

Now we formally consider this problem since this construction process can be described by two ways:
- From bottom to the top(\(C_{\ast}\)): We define \(C_{\ast}\) to be the set generated by \(B\) with \(\mathcal{F}\). Here by generated we mean the generating process above.

- From top to the bottom(\(C^{\ast}\)):
  We define \(C^{\ast}\) to be the intersection of all subsets of \(B\) closed under the operations in \(\mathcal{F}\)

- We show these two sets are actually the same.

Here one might meet two definitions which is important:

#+ATTR_LATEX: :options [Closed under operations]
#+BEGIN_definition
Let \(S\) be a set closed under operations, then for any elements of \(S\), their interactive(combinition for all) image under those operations are contained in \(S\).
#+END_definition

#+ATTR_LATEX: :options [Inductive Set]
#+BEGIN_definition
For initial set \(B\), we say a set \(S\) is inductive if:
- \(B \subseteq S\)
- \(S\) is closed under the given operation class.
#+END_definition

By all the above conventions one can reach the following theorem:

#+ATTR_LATEX: :options [ ]
#+BEGIN_theorem
\(C^{\ast}\) = \(C_{\ast}\).
#+END_theorem

Now we can formally describe the induction principle:

#+ATTR_LATEX: :options [Induction Principle]
#+BEGIN_theorem
Let \(C\) is the set generated from \(B\) by the operations in \(\mathcal{F}\). For any set \(S\) lies between \(B,C\), with the assumption that it closed under operations in \(\mathcal{F}\), then \(S = C\).
#+END_theorem

** Recursion
*** Freely Generated Sets
*Because one needs to define functions recursively over an inductive closure, the freely generated property allows us to unique reprsent the elements in the generated set by a tree.*

eg. In the process of evaluating the expressions we first define a function which enables us to evaluate the atoms, the we recursively define the extension of the function to evaluate all expressions. By free generation we can make sure that the tree for the evaluation process for each expression is unique.

#+ATTR_LATEX: :options [Freely Generated Sets]
#+BEGIN_definition

#+END_definition
*A problem we care about: How to recursively define a function?*
Basically we need 3 functions
- g:= "Push forward function"
- f:= "Form of base case function"
- h:= "Recursive defined function"
with few rules on how these functions are interacting with each other.

** Compactness and Effectiveness
*Convention: Let \(\Sigma\) denote a set of wffs.*
#+ATTR_LATEX: :options [Compactness Theorem]
#+BEGIN_theorem
\(\Sigma\) is satisfiable iff every finite subset of \(\Sigma\) is satisfiable.
#+END_theorem

*Remark: This theorem is called compactness theorem since it is kind of looks like the compactness defined in analysis.*

#+ATTR_LATEX: :options [Finitely satisfiable(Temporarily definiton)]
#+BEGIN_definition
\(\Sigma\) is finitely satisfiable iff every finite subset is satisfiable.
#+END_definition
# Just give a name to describe what we want to prove about the compactness theorem.


#+ATTR_LATEX: :options [Proof Sketch]
#+BEGIN_proof
\leavevmode

- we first use the given finitely satisfiable set to extend it to the maximal.
- Then we construct a truth assignment out of the maximal set we construct above to satisfies \(\Sigma\).
#+END_proof

