MathematicalLogicAndTheoreticalCS/AMathIntroToLogic/AMathIntroToLogic.tex
% Created 2024-11-12 Tue 18:49
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\input{~/Preamble/preamble.tex}
\author{Herbert Enderton Notes taken by Dendy Li}
\date{\today}
\title{A Mathematical Introduction To Logic}
\hypersetup{
 pdfauthor={Herbert Enderton Notes taken by Dendy Li},
 pdftitle={A Mathematical Introduction To Logic},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Sentential Logic}
\label{sec:orgf8a340f}
\subsection{Informal remarks on the basic objects}
\label{sec:orga1cb7e1}

\begin{center}\begin{tikzcd}
& \text{Construction Sequence} & \\
& \text{Wffs} \ar[u,"\text{Formula Building Operations}"] & \\
& \text{Expressions} \ar[u,"\text{Inductive Definition}"] & \\
& \text{Sequence} \ar[u] & \\
\text{Sentential Connectives Symbols} \ar[ur] & \text{Sentence Symbols} \ar[u] & \text{Proposition Symbols} \ar[l]
\end{tikzcd}\end{center}


\begin{definition}[Sentential Connective Symbols]
Sentential connective symbols is the symbols which have fixed translations.
\end{definition}

eg. We have five sentential connective symbols in sentential logic namely
\begin{itemize}
\item \(\neg\)
\item Conjunction \(\land\)
\item Disjunction \(\lor\)
\item Implies \(\rightarrow\)
\item Iff \(\leftrightarrow\)
\end{itemize}

\begin{definition}[Sentence Symbols]
Sentence symbols are the symbols which doesn't fixed the translation.
\end{definition}

\textbf{Remark: We also have proposition symbols for some case we want the translation of them are propositions}

\begin{definition}[Expressions]
Expressions just finite sequence of symbols(both sentential connective symbols and sentence symbols).
\end{definition}

\textbf{Remark: In order to avoid the Russuell's Paradox we assume that no symbol is a finite sequence of symbols}

\begin{definition}[Well Form Formula]
Well form formulas are just Grammarly correct expressions. By Grammarly correct we means the inductive definition of the well form formula.
\end{definition}

\begin{proposition}[Inductive definition of wffs]
All the wffs can only be obtained by the following rules
\begin{itemize}
\item Every sentence symbol is a wff
\item If \(\alpha\) is a formula then \(\neg\alpha\) is a wff
\item If \(\alpha, \beta\) are wffs then \(\alpha \circ \beta\) is a wff
\end{itemize}
Here \(\circ\) represents the other 4 sentential connectives we didn't mention above.
\end{proposition}

We will then define the formula building operations to show how wff is built up.

\begin{definition}[Formula building operations]
For wff \(\alpha,\beta\), formula building operation is defined as follows:
\begin{itemize}
\item \(\Epsilon_{\neg} (\alpha) = (\neg\alpha)\)
\item \(\Epsilon_{\circ} (\alpha,\beta) = (\alpha \circ \beta)\)
\end{itemize}
Here \(\circ\) is one of the other 4 sentential connectives.
\end{definition}

\begin{definition}[Construction Sequence of a wff]
The construction sequence of a wff \(\alpha\) is a sequence \(<a_1,\dots,\alpha>\), where every \(a_i\) is obtained by element in the front of \(a_i\) under the formula building operations.
\end{definition}
\subsection{Induction}
\label{sec:orgc7e16e6}
\textbf{Induction is a special type of construction, especially when we face the problem that the inductive defintion brings to us.}

Here we have ``Universal'' progress on meta-strategy of how induction works:
\textbf{Goal: Starting from a set \(U\), construct a subset of \(U\) satisfies certain properties.}

\begin{center}\begin{tikzcd}
\text{Initial elements} \ar[loop right, "\text{Construction operations}"] \ar[d] \\
\text{Smallest set closed under the operations}
\end{tikzcd}\end{center}

\textbf{Remark: Every members in the ``Gerating Set'' can be build up from the initial elements by apply the construction operations. This also arise the interests to talk about the definition of free generation, namely whether the construction sequence is unique or not.}

eg. We can have an easy understandable case where the initial elements are just the sentence symbols, the operations are formula building operations. In this case the set we generate is just the set of well-formed-formulas.

Next we want to formally discuss this ``Smallest Set''. For convinient we use the following conventions:
\begin{itemize}
\item Initial set \(B \subseteq U\)
\item Class of operations \(\mathcal{F}:=\{f,g\}\), where \(f:U \times U \to U, g: U \to U\).
Notice that in a general case the class of operations should be infinite.
\end{itemize}

With the notation above we use a little more formal language to represent the process:

WLOG suppose \(B\) contains points \(a,b\), then \(C\) will contain the elements in the form of:
  \[
  b, f(b,b), g(b), f(g(a)), \dots
  \]

Now we formally consider this problem since this construction process can be described by two ways:
\begin{itemize}
\item From bottom to the top(\(C_{\ast}\)): We define \(C_{\ast}\) to be the set generated by \(B\) with \(\mathcal{F}\). Here by generated we mean the generating process above.

\item From top to the bottom(\(C^{\ast}\)):
We define \(C^{\ast}\) to be the intersection of all subsets of \(B\) closed under the operations in \(\mathcal{F}\)

\item We show these two sets are actually the same.
\end{itemize}

Here one might meet two definitions which is important:

\begin{definition}[Closed under operations]
Let \(S\) be a set closed under operations, then for any elements of \(S\), their interactive(combinition for all) image under those operations are contained in \(S\).
\end{definition}

\begin{definition}[Inductive Set]
For initial set \(B\), we say a set \(S\) is inductive if:
\begin{itemize}
\item \(B \subseteq S\)
\item \(S\) is closed under the given operation class.
\end{itemize}
\end{definition}

By all the above conventions one can reach the following theorem:

\begin{theorem}[ ]
\(C^{\ast}\) = \(C_{\ast}\).
\end{theorem}

Now we can formally describe the induction principle:

\begin{theorem}[Induction Principle]
Let \(C\) is the set generated from \(B\) by the operations in \(\mathcal{F}\). For any set \(S\) lies between \(B,C\), with the assumption that it closed under operations in \(\mathcal{F}\), then \(S = C\).
\end{theorem}
\subsection{Recursion}
\label{sec:org6162214}
\subsubsection{Freely Generated Sets}
\label{sec:org8685b4b}
\textbf{Because one needs to define functions recursively over an inductive closure, the freely generated property allows us to unique reprsent the elements in the generated set by a tree.}

eg. In the process of evaluating the expressions we first define a function which enables us to evaluate the atoms, the we recursively define the extension of the function to evaluate all expressions. By free generation we can make sure that the tree for the evaluation process for each expression is unique.

\begin{definition}[Freely Generated Sets]

\end{definition}
\textbf{A problem we care about: How to recursively define a function?}
Basically we need 3 functions
\begin{itemize}
\item g:= ``Push forward function''
\item f:= ``Form of base case function''
\item h:= ``Recursive defined function''
\end{itemize}
with few rules on how these functions are interacting with each other.
\subsection{Compactness and Effectiveness}
\label{sec:orgcf93293}
\textbf{Convention: Let \(\Sigma\) denote a set of wffs.}
\begin{theorem}[Compactness Theorem]
\(\Sigma\) is satisfiable iff every finite subset of \(\Sigma\) is satisfiable.
\end{theorem}

\textbf{Remark: This theorem is called compactness theorem since it is kind of looks like the compactness defined in analysis.}

\begin{definition}[Finitely satisfiable(Temporarily definiton)]
\(\Sigma\) is finitely satisfiable iff every finite subset is satisfiable.
\end{definition}


\begin{proof}[Proof Sketch]
\leavevmode

\begin{itemize}
\item we first use the given finitely satisfiable set to extend it to the maximal.
\item Then we construct a truth assignment out of the maximal set we construct above to satisfies \(\Sigma\).
\end{itemize}
\end{proof}
