MathematicalLogicAndTheoreticalCS/AMathIntroToLogic/AMathIntroToLogic.org
* First-Order Logic
Propositional Logic is a basic model for us to formally express our informal mathematics. However, Propositional Logic can't describe the quatifiers, by adding the quatifiers and inherits some ideas of Propositional Logic, we have the first-order Logic, which allows us to formally talk about more mathematical structures.

Some important features from the Chapter 1: Notice that \(\{\neg, \to\}\) is complete so we want out sentential connectives only include these two symbols. Also, notice that \(\exists = \neg \forall \neg\), we only want to include the universal quantifier.

Getting familiar with some basic ideas of first-order logic:
- Socretes is a man, here "is a man" is a predicate.
- Metamathematics refers to the procedure of stepping back and examining what the mathematician is doing.
** First-order language
*** Expressions, Terms, Atomic Formulas and Well-formed formulas
*Assumption: we are given infinitely many distinct symbols as follows:*
- Logical Symbols
  + Parentheses
  + Sentential connective symbolsa
  + Variables(countably many)
  + Equality symbol(optional)
- Parameters
  + Quantifier symbol
  + Predicate
  + Function symbol
  + Constant symbol(0-place function symbol)
*Remark: All symbols appear here are all distinct, Logical Symbols and Parameters are determinated we say the language is been determinated.*

#+ATTR_LATEX: :options [Distinctions between languages]
#+BEGIN_proposition
Languages are only distinct in parameters and equalities.
#+END_proposition

Next we look at the language of set theory and the language of the elementary number theory to see why large mathematics can be embedded into set theory.

\begin{align*}
& \text{Language of set theory} && \text{Language of elementary number theory} \\
& \text{Predicates : yes} &&  \text{Predicates : yes}\\
& \text{Functions : no} &&  \text{Functions : yes}\\
& \text{Constants : yes} && \text{Constants : yes}\\
& \text{Equality : yes} && \text{Equality : yes}
\end{align*}

I omit the concrete type of the parameters here, but the reader can have a feeling that the language of set theory can somehow embed in the language of elementary number theory. Just like Group can be embed in a ring.

We have the following informal expression about the statement above:
Large mathematcis can be embedded into set theory because they can be expressed by set theory and mathematics theorem follow logically from the axioms of set theory.

Here is a unintuitive phenomenon of first-order logic:
eg.

\begin{align*}
\exists v_1 (Av_1 \land Bv_1) & \quad \text{There is an object } v_1, \text{ such that } v_1 \text{ is an apple and } v_1 \text{ is a bad apple.} \\
\exists v_1 (Av_1 \to Bv_1) & \quad \text{There is an object } v_1, \text{ such that if } v_1 \text{ is an apple, then } v_1 \text{ is a bad apple.}
\end{align*}

The second formula is more asserting than the first formula, since the first formula will fail in the universe where there is no apple exists while the second formula still remaning true. (Because the second formula has the assumption if the object is an apple.)

# In align environment it is very important to have & when starting a new line.
# t\ + tab for \text

Few words which need a little declaration:
+ nonsensical: no meaning
+ assertion: confindent statement
+ intend to: want to or plan to

#+ATTR_LATEX: :options [Expression]
#+BEGIN_definition
An expression is a finite sequence of symbols.
#+END_definition

Not all the expressions have meaning, we might stick to some of the meaningful sentences-Terms, Atomic formulas, Well-formed formulas.

We have the following correspondence:
\begin{align}
\text{Nouns and Pronouns} & \leftrightarrow \text{Terms} \\
\text{Sentencial symbols} & \leftrightarrow \text{Atomic formulas}
\end{align}

*Comparing with the natural languages, we want the term to be the name of the objects and well-formed formulas to be the assertions.*

Construction of meaningful expressions:
+ Construction of terms
  - For every function \(f\), there is an induced formula building operation \(\mathcal{F}_f\) where compound n variables into one term(for n-placed function symbol \(f\)).
  - *Definition of the term:* Every term is of the form \(\mathcal{F}_f(\text{sequence of constant symbols or variables})\).
  - One special case is that, there are no function symbol in the language, so the terms are just constant and variables.
  - Syntax of the term:
    + Polish notation
    + No parentheses(Unique readability theorem ensure the well-define)

+ Construction of Atomic formulas
  - Atomic formulas aren't defined by induction, it's just a sequence starting with a n-placed predicate symbol follows by n terms.

+ Construction of Well-formed formulas
  - Well-formed formulas are expressions which are built from the atomic formulas by the defined formula building operations on the expressions(For implication, negation, universal quantifiers).

    *Remark: Atomic Formulas are wffs.*

*** Free Variables
*In natural languages, the following examples express the idea of free variables:*
\begin{align*}
\forall v_2 \in v_2v_1 & \  \text{Every set is a number of (  )} \\
(\neg\forall v_1(\neg \forall v_2 \in v_2v_1)) & \ \text{There is a set } v_1, v_1 \text{doesn't contain every } v_2 \text{ as a subset.}
\end{align*}

*Remark: Free variable just likes "Blank" in our everyday language, next we want to formally define what is a free variable since we don't want our definition relies on the translation in Natural language.*

In order to directly define what is a free variable, we first define what does a variable occurs free in a given formula means, then a variable occus free is a free variable.

#+ATTR_LATEX: :options [Occur free]
#+BEGIN_definition
Let \(\phi,\varphi\) be wffs, \(\alpha\) is atomic formula:
+ For atomic formula \(\alpha\), \(x\) occurs free in \(\alpha\);
+ For formula \(\neg\varphi\), \(x\) occurs free in \(\neg\varphi\) iff \(x\) occurs free in \(\varphi\);
+ For formula \(\varphi \to \phi\), \(x\) occurs free in \(\varphi \to \phi\) iff \(x\) occurs free in \(\varphi\) and \(\phi\);
+ \(x\) occuts free in \(\forall y \varphi\) iff \(x \neq y\) and \(x\) occuts free in \(\varphi\).

  We say \(x\) is a free variable in formula \(\phi\) if \(x\) occurs free in \(\phi\).
#+END_definition

*The definition above is valid because we can first define the occur free on atomic formulas and basic construction of atomic formulas, then by recursion theorem we can extend the definition on atomic formulas to wffs.*


#+ATTR_LATEX: :options [Sentence]
#+BEGIN_definition
A wff without any free variable is a sentence.
#+END_definition
*This definition is intuitively valid, since when we talk to each other we normally don't leave blank while talking.*

*** Conventions for readability of First order language
In the definition of First order language, we don't use \(\land, \lor, \neq, \dots\), but this will make the formulas hard for us to read. We have the following convention:
+ Negation and Universal quantifiers control the smallest formula next to it;
+ Repeat expressions group to right.
