MathematicalLogicAndTheoreticalCS/AMathIntroToLogic/AMathIntroToLogic.org
** Truth and Models

\begin{align*}
& \text{Sentencial Logic} \Leftarrow \text{Truth assignment(Tell truth by the value)} \\
& \text{First order Logic} \Leftarrow \text{Structure(Tell truth by checking the dictionary)}
\end{align*}

*Structure is a dictionary for us to check the interpretations of the formulas.*

#+ATTR_LATEX: :options [Structure]
#+BEGIN_definition
Structure is a function which can be described as follows:
\begin{center}
\begin{align*}
\forall &\mapsto \lvert\mathfrak{A}\rvert \\
\text{n-ary Predicate symbols} &\mapsto \text{Relations on } \lvert\mathfrak{A}\rvert^{n}\\
\text{n-ary Function symbols} &\mapsto \text{Operations on} \lvert\mathfrak{A}\rvert^{n}\\
\text{Constant symbols } c &\mapsto c^{\mathfrak{A}} \in \lvert\mathfrak{A}\rvert.
\end{align*}
\end{center}
#+END_definition

# in align environment, one isn't allow to use any feature from the "text" such as leave a blank line to replace the line break.

Here we recall a little bit about the definition of relation and operations to have a clear understanding of what does the structure \(\mathfrak{A}\) looks like.

#+ATTR_LATEX: :options [n-ary relation and n-ary operation]
#+BEGIN_definition
\(n\)-ary opertaion on \(A\) is a function:
\[
F:A^n \to A,
\]
where any subset of \(A^n\) is a \(n\)-ary relation on \(A\).
#+END_definition

One might want to ask: What's the difference between a function and a relation, we have the follow informal definition:
#+ATTR_LATEX: :options [Function]
#+BEGIN_definition
\(F\) is called a function if:
+ \(F\) is a relation;
+ No two distinct pairs in \(F\) have the same first coordinate.
#+END_definition

*So a \(n\)-ary function is somehow a \(n+1\)-ary relation with additional property(first coordinate unrepeated).*

Informally a structure \(\mathfrak{A}\) can be viewed as a set with different forms of elements. There are tuples to represent the relation, functions, there are "Points" to represent the universe where the constant symbols lies in.

*Here we might remind myself a little bit on what's the relationship between the structure and the language. The structure plays the row of the truth assignment where the language is for how to write the grammarly correct sentences.*

\begin{center}\begin{tikzcd}
\text{Informal Mathematics} \ar[r,"embedded"] \ar[rd, swap,"Judge"] & \text{First order language of it}(L) \ar[r,"Produce"] & \text{Wffs} \ar[d,"Input"]\\
 & \text{Informal statements}&\ar[l,"Interpretate"] \text{Structure of } L
\end{tikzcd}\end{center}

eg. In the first order language for set theory, take \(\mathfrak{A} = (\lvert\mathfrak{A}\rvert, \in^{\mathfrak{A}})\) where \(\lvert\mathfrak{A}\rvert:=\N\) and \(\in^{\mathfrak{A}}:=\{<m,n>| m < n, m,n \in \N\}\). Given a formula in first order language of set theory, we can translate it into the informal statement and use our knowledge about set theory to check whether the sentence is true or false. *If this sentence \(\varphi\) is true, we say the structure \(\mathfrak{A}\) is a model of \(varphi\).*

*One little remark is the first order language of set theory doesn't mean the set theory we use in the informal mathematics, a first order language of set theory is any language equipped with a universe which has a contant symbol for empty set and a 2-ary predicate for inclusion.*

One problem of the translation above is that we can't handle the truth of the self-reference sentences, like "This sentence is false.". This is the motivation for a formal definition of what do we mean by a sentence is true under the structure \(\mathfrak{A}\).

*** Define Truth by structure
Like in sentential logic, we define the "truth" with respect to "Truth Assignment". Here "Truth Assignment" we simply mean a "Translation in the Model".
** Deductive Calculus
*** Formal Deductions
Basic ideas of deduction:
\begin{center}\begin{tikzcd}
\text{Axioms } + \text{Assertions} \ar[r] \ar[d] & \text{Theorems} \\
\Lambda \cup \Gamma + \text{Deduction} \ar[r] & \text{Theorems}
\end{tikzcd}\end{center}

In the second line, a theorem is just a formula obtain from \(\Lambda \cup \Gamma\) by the rule of inference, which we call deduction here.


#+ATTR_LATEX: :options [Deduction]
#+BEGIN_definition
Let \(\Lambda\) be a set of infinitely many fomulars, we usually call it axioms. A deduction is a finite sequence of formulas s.t. every element in the sequence can be interfere by earlier ones or this element lies in the axioms or theorems.
#+END_definition

#+ATTR_LATEX: :options [Generalization Theorem]
#+BEGIN_theorem
If \(\Gamma \vdash \varphi\) and \(\forall \alpha \in \Gamma, \ x \notin Free(\alpha)\), then we can add universal quantifier before formula \(\varphi\), namely:
\[
\Gamma \vdash \forall \ x \varphi.
\]
#+END_theorem

#+ATTR_LATEX: :options [Six groups of Logical axioms]
#+BEGIN_definition
The following are six groups of Logical axioms:
- Generalization of tautologies;
- Generalization of \(\forall x\alpha \to \alpha^x_t\), \(t\) is substitutable for \(x\) in \(\alpha\);
- Generalization of \(\forall x(\alpha \to \beta) \to (\forall x\alpha \to \forall x\beta)\);
- Generalization of \(\alpha \to \forall x\alpha\);
- Generalization of \(x = x\);
- Generalization of \(x = y \to (\alpha \to \alpha^{\prime}\), where \(\alpha^{\prime}\) obtained from \(\alpha\) by replacing \(x\) in 0 or more occurrences by \(y\).
#+END_definition

Next we give some detailed consideration of the logical axioms above.
** Completeness Theorem
The completeness theorem can give us aan answer about the equivalence of \(\models\) and \(\vdash\). Then equivalence them will be given in two different theorems namely soundness theorem and completeness theorem.
*** Soundness theorem

#+ATTR_LATEX: :options [Soundness theorem]
#+BEGIN_theorem
If \(\Gamma \vdash \varphi\), then \(\Gamma \models \varphi\).
#+END_theorem

*** Completeness theorem

#+ATTR_LATEX: :options [Completeness theorem]
#+BEGIN_theorem
If \(\Gamma \models \varphi\), then \(\Gamma \vdash \varphi\).
#+END_theorem

We will not follow Gödel's proof of the completeness theorem. We will use the Henkin Construction.

Here's a sketch of how the proof goes:

\begin{center}\begin{tikzcd}
\Gamma \ar[r] \ar[d] \ar[rd] & \mathcal{L} \ar[d] \\
\Gamma \cup \Theta \ar[r] \ar[d] & \mathcal{L}^{\prime} \ar[d] \\
\Delta \ar[ru] \ar[rd] \ar[r] & A \ar[d]\\
& A/E
\end{tikzcd}\end{center}

We fixed a countable language \(\mathcal{L}\) and a set of consistent formulas \(\Gamma\).
+ Step-1: Extend the Language \(\call\) by adding countably infinite constant symbols, the set \(\Gamma\) still consistant in \(\call^{\prime}\);

+ Step-2: Extend the set of consistant formulas by adding formulas of the form,
  \[
  \neg\forall x \varphi \to \neg \varphi  ^{x}_{c},
  \]
  which gives a enumeration of the formulas by the constant symbols we add. The new set of consistant formulas is still consistant in the new language \(\call^{\prime}
  \).

+ Step-3: We further construct the set \(\Delta\) which contains \(\Gamma \cup \Theta\) as a subset and satisfies the property that if there's a deduction sequence in \(\Delta\) then we the formula is in \(\Delta\).

+ Step-4: Let \(A\) to be the set of all terms from \(\call ^{\prime}\) then define an equivalence relation \(E\) on \(A\):
  \[
  x \simeq y \text{ iff } (x = y) \in \Delta
  \],
  check this is actually an congruence relation.

+ Step-5: We create the structure which has domain \(A/E\), since \(E\) is a congruence relation we know that \(A/E\) is well-defined.

+ Step-6: Check this is the structure we want to prove the completeness theorem.

+ Step-7: Now we push down this structure back to the original language simply by "Forget all the constant symbols".
